threadz/app/controllers/comments_controller.rb

def create
  @comment = Comment.new(comment_params)
  @outfit = Outfit.find(params[:comment][:outfit_id])
  @clothing = Clothing.find(params[:comment][:clothing_id])
  unless @comment.save
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "outfits".* FROM "outfits" WHERE "outfits"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "clothings".* FROM "clothings" WHERE "clothings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "created_at", "updated_at", "clothing_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "hi"], ["created_at", "2017-11-17 20:09:42.188523"], ["updated_at", "2017-11-17 20:09:42.188523"], ["clothing_id", 3]]