threadz/app/controllers/outfits_controller.rb

SELECT "outfits".* FROM "outfits"
---
def index
  @outfits = Outfit.all

SELECT  "outfits".* FROM "outfits" WHERE "outfits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def show
  @outfit = Outfit.find(params[:id])

INSERT INTO "outfits" ("name", "occasion", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Monday's Fit"], ["occasion", "class"], ["created_at", "2017-11-20 20:54:35.643777"], ["updated_at", "2017-11-20 20:54:35.643777"], ["user_id", 3]]
---
def create
  @outfit = Outfit.new(outfit_params)
  @outfit.user_id = current_user.id
  if @outfit.valid?
    @outfit.save

SELECT  "outfits".* FROM "outfits" WHERE "outfits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def edit
  @outfit = Outfit.find(params[:id])

UPDATE "outfits" SET "occasion" = $1, "updated_at" = $2 WHERE "outfits"."id" = $3  [["occasion", "Tomorrow"], ["updated_at", "2017-11-16 20:32:57.231267"], ["id", 2]]
---
def update
  if @outfit.update(outfit_params)

SELECT  "outfits".* FROM "outfits" WHERE "outfits"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
def set_outfit
  @outfit = Outfit.find(params[:id])