app/controllers/clothings_controller.rb

def index
  @clothings = Clothing.all
---
SELECT "clothings".* FROM "clothings"

def show
  @comments = @clothing.comments.order(:created_at)
---
SELECT "comments".* FROM "comments" WHERE "comments"."clothing_id" = $1 ORDER BY "comments"."created_at" ASC  [["clothing_id", 1]]

def new
  @clothing = Clothing.new
  @outfits = Outfit.all
---
SELECT "outfits".* FROM "outfits"

def create
  @clothing = Clothing.new(clothing_params)
  if @clothing.valid?
    @clothing.save
---
INSERT INTO "clothings" ("name", "kind", "created_at", "updated_at", "outfit_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "blazer"], ["kind", "black"], ["created_at", "2017-11-17 15:18:16.932725"], ["updated_at", "2017-11-17 15:18:16.932725"], ["outfit_id", 1]]

def edit
  @clothing = Clothing.find(params[:id])
  @outfits = Outfit.all
---
SELECT  "clothings".* FROM "clothings" WHERE "clothings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "outfits".* FROM "outfits"

def update
  if @clothing.update(clothing_params)
---
UPDATE "clothings" SET "image_file_name" = $1, "image_updated_at" = $2, "updated_at" = $3 WHERE "clothings"."id" = $4  [["image_file_name", "Screen_Shot_2017-11-13_at_11.10.04_PM.png"], ["image_updated_at", "2017-11-20 19:09:33.173709"], ["updated_at", "2017-11-20 19:09:33.198589"], ["id", 3]]

def destroy
  if @clothing.destroy
---
DELETE FROM "clothings" WHERE "clothings"."id" = $1  [["id", 1]]

def set_clothing
  @clothing = Clothing.find(params[:id])
---
SELECT  "clothings".* FROM "clothings" WHERE "clothings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]